/*
 * @Author: huazihear 
 * @Date: 2019-06-03 11:44:07 
 * @Last Modified by: huazihear
 * @Last Modified time: 2019-06-05 00:45:58
 * 这个文件使用js编写，后面需要嵌入混淆后的代码
 * number ^ rdXor = xorNumber,  xorNumber ^ rdXor = number
 *
 */

var __459834_ = ["\x5F\u0159", "\x5F\u015A", "\x5F\u015C", "\x5F\u015E", "\x5F\u0160", "\x5F\u015B", "\x5F\u015D", "\x5F\u015F", "\x5F\u0161", "\x5F\u0162", "\x5F\u0164", "\x5F\u0166", "\x5F\u0163", "\x5F\u0165", "\x5F\u0167", "\x63\x68\x61", "\x23", "\x73\x70\x6C\x69\x74", "\x73\x70", "\x6C\x69\x74", "\x72\x43\x6F\x64", "\x6C\x69\x63\x65", "\x65\x41\x74", "\x73\x68\x69\x66\x74", "\x6C\x65\x6E\x67\x74\x68", "", "\x70\x6F\x70", "\x63\x68\x61\x72\x43\x6F\x64\x65\x41\x74", "\x66\x72\x6F\x6D\x43\x68\x61\x72\x43\x6F\x64\x65", "\x70\x75\x73\x68", "\x6A\x6F\x69\x6E"];
var __77346_ = [__459834_[0], __459834_[1], __459834_[2], __459834_[3], __459834_[4], __459834_[5], __459834_[6], __459834_[7], __459834_[8], __459834_[9], __459834_[10], __459834_[11], __459834_[12], __459834_[13], __459834_[14]];
function obtainString(__179647_, __763224_, __234389_) {
    var __786782_ = __459834_[15];
    var _0x750ex7 = __179647_[__459834_[17]](__459834_[16]);
    var __445678_ = __459834_[18];
    __179647_ = _0x750ex7[0]; __763224_ = _0x750ex7[1]; __445678_ += __459834_[19]; __234389_ = _0x750ex7[2]; __786782_ += __459834_[20]; var _0x750ex9 = __77346_[__763224_];
    var _0x750exa = __459834_[21];
    var __875427_ = __179647_[__445678_](_0x750ex9);
    __786782_ += __459834_[22]; __875427_[__459834_[23]](); 
    if (__875427_[__459834_[24]] === 0) {
        __875427_ = __179647_[__445678_](__459834_[25]); __763224_ = __875427_[__459834_[18] + _0x750exa](0, 1)[0]; __763224_ = __763224_[__786782_](); __234389_ = __875427_[__459834_[26]]()[__786782_]()
    }
    var __904423_ = [];
    var _0x750exd = __234389_ ^ __763224_;
    for (var __755427_ = 0; __755427_ < __875427_[__459834_[24]]; __755427_++) {
        var __445678_ = __875427_[__755427_];
        __445678_ = Number(__445678_) || __445678_[__459834_[27]](); var __23658_ = __445678_ - _0x750exd;
        var __87245_ = String[__459834_[28]](__23658_);
        __904423_[__459834_[29]](__87245_)
    }
    return __904423_[__459834_[30]](__459834_[25])
}



// function obtainString(str, rdNumber, xorNumber) {
//     var d = 'sp';
//     d += 'lit';
//     var sa = str[d]('#');
//     str = sa[0];
//     rdNumber = sa[1];
//     xorNumber = sa[2];
//     var splitCh = __77346_[rdNumber];
//     var strArray = str[d](splitCh);
//     strArray.shift();
//     if (strArray.length === 0) {
//         strArray = str[d]('');
//         rdNumber = strArray.splice(0,1)[0].charCodeAt();
//         xorNumber = strArray.pop().charCodeAt();
//     }
//     var result = [];
//     var prefix = xorNumber ^ rdNumber;
//     for (var i = 0; i < strArray.length; i++) {
//         d = 'char';
//         d += 'CodeAt';
//         var s = strArray[i];
//         s = Number(s) || s[d]();
//         d = 'from';
//         d += 'Char';
//         var sCode = s - prefix;
//         d += 'Code';
//         var nCode = String[d](sCode);
//         d = 'push';
//         result[d](nCode);
//     }
//     d = 'jo';
//     d += 'in';
//     return result[d]('');
// }


// module.exports = obtainString;